# Pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Introduction to data series

In [2]:
students=pd.Series([16,12,17],index=['George', 'Anna', 'Drake'])
students

George    16
Anna      12
Drake     17
dtype: int64

In [3]:
students[1]

12

In [4]:
students.index #will show the keys
students.values  #will show the values

array([16, 12, 17], dtype=int64)

In [5]:
students.shape #will show the shape

(3,)

## Introduction to dataframes

In [6]:
students=pd.DataFrame({'age':[16,12,17], 'scholarship':['HS','HS','U']},
                     index=['George', 'Anna', 'Drake'])
display(students) #to show the table we add display
print('Students')

        age scholarship
George   16          HS
Anna     12          HS
Drake    17           U

Students

In [7]:
students.dtypes #type of data

age             int64
scholarship    object
dtype: object

In [8]:
students.index

Index(['George', 'Anna', 'Drake'], dtype='object')

In [9]:
students.axes #shows the axes of the table

[Index(['George', 'Anna', 'Drake'], dtype='object'),
 Index(['age', 'scholarship'], dtype='object')]

In [10]:
students.columns #show the columns of the table

Index(['age', 'scholarship'], dtype='object')

## Ways to create series and dataframes

In [11]:
students={'Joseph':14,'Diana':15}
pd.Series(students, index=['Joseph','Diana'])

Joseph    14
Diana     15
dtype: int64

In [12]:
pd.Series(8,index=['a','b','c']) #creating a series of scalar form

a    8
b    8
c    8
dtype: int64

In [13]:
A=np.array([[1,2],[4,6]])
pd.DataFrame(A, index=['a','b'], columns=['col1','col2']) #specifying that the rows be called: row a and row b//columns called cold1 and cold2

   col1  col2
a     1     2
b     4     6

## Importing data from a file

In [14]:
df1=pd.read_excel('ejemplo.xlsx') #importing data from an excel file
df1

   Mes  Ingreso  Gasto
0  Ene      200     50
1  Feb      300     40
2  Mar      150     90

In [15]:
df2=pd.read_csv('ejemplo.csv', sep='\s+') #importing data from an csv file|correcting the file format with "sep" argument ('\s+'=Tab)
display(df2.head())
df2.shape

                     race  distance  climb   time
0  GreenmantleNewYearDash       2.5   0.65  16.08
1       Carnethy5HillRace       6.0   2.50  48.35
2     CraigDunainHillRace       6.0   0.90  33.65
3          BenRhaHillRace       7.5   0.80  45.60
4       BenLomondHillRace       8.0   3.07  62.27

(35, 4)

## Inspecting a dataframe

In [16]:
df2.head(10) #head method shows the data by default the first 5-->(), in this case-->(10)

                     race  distance  climb    time
0  GreenmantleNewYearDash       2.5  0.650   16.08
1       Carnethy5HillRace       6.0  2.500   48.35
2     CraigDunainHillRace       6.0  0.900   33.65
3          BenRhaHillRace       7.5  0.800   45.60
4       BenLomondHillRace       8.0  3.070   62.27
5        GoatfellHillRace       8.0  2.866   73.22
6      BensofJuraFellRace      16.0  7.500  204.62
7     CairnpappleHillRace       6.0  0.800   36.37
8          ScoltyHillRace       5.0  0.800   29.75
9         TraprainLawRace       6.0  0.650   39.75

In [17]:
df2.sample(6) #show any row defalut one-->(), in this case(6)

                     race  distance  climb    time
12  LomondsofFifeHillRace       9.5   2.20   65.00
19      CreagBeagHillRace       5.5   0.60   32.57
4       BenLomondHillRace       8.0   3.07   62.27
1       Carnethy5HillRace       6.0   2.50   48.35
11         DollarHillRace       5.0   2.00   43.05
6      BensofJuraFellRace      16.0   7.50  204.62

In [18]:
df2.describe() #shows the most common statistical data

        distance      climb        time
count  35.000000  35.000000   35.000000
mean    7.528571   1.815314   56.089714
std     5.523936   1.619151   50.392617
min     2.000000   0.300000   15.950000
25%     4.500000   0.725000   27.415000
50%     6.000000   1.000000   36.370000
75%     8.000000   2.200000   63.635000
max    28.000000   7.500000  204.620000

In [19]:
df2.info() #information of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   race      35 non-null     object
 1   distance  35 non-null     float64
 2   climb     35 non-null     float64
 3   time      35 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.2+ KB

## Accessing the data

In [20]:
df3=pd.read_csv('ejemplo.csv',sep='\s+')
df3.set_index('race', inplace=True)
display(df3.head())

                        distance  climb   time
race
GreenmantleNewYearDash       2.5   0.65  16.08
Carnethy5HillRace            6.0   2.50  48.35
CraigDunainHillRace          6.0   0.90  33.65
BenRhaHillRace               7.5   0.80  45.60
BenLomondHillRace            8.0   3.07  62.27

In [21]:
df3['distance'] #accessing the column

race
GreenmantleNewYearDash        2.5
Carnethy5HillRace             6.0
CraigDunainHillRace           6.0
BenRhaHillRace                7.5
BenLomondHillRace             8.0
GoatfellHillRace              8.0
BensofJuraFellRace           16.0
CairnpappleHillRace           6.0
ScoltyHillRace                5.0
TraprainLawRace               6.0
LairigGhruFunRun             28.0
DollarHillRace                5.0
LomondsofFifeHillRace         9.5
CairnTableHillRace            6.0
EildonTwoHillsRace            4.5
CairngormHillRace            10.0
SevenHillsofEdinburghRace    14.0
KnockHillRace                 3.0
BlackHillRace                 4.5
CreagBeagHillRace             5.5
KildoonHillRace               3.0
MeallAntSuidheHillRace        3.5
HalfBenNevis                  6.0
CowHillRace                   2.0
NorthBerwickLawRace           3.0
CreagDubhHillRace             4.0
BurnswarkHillRace             6.0
LargoLawRace                  5.0
CriffelHillRace               6.5
AchmonyHillRace               5.0
BenNevisRace                 10.0
KnockfarrelHillRace           6.0
TwoBreweriesFellRace         18.0
CockleroiHillRace             4.5
MoffatChase                  20.0
Name: distance, dtype: float64

In [22]:
df3.loc['LargoLawRace'] #accessing data from a single row

distance     5.00
climb        0.95
time        28.57
Name: LargoLawRace, dtype: float64

In [23]:
df3.iloc[1] #accessing the data of a single row by its index

distance     6.00
climb        2.50
time        48.35
Name: Carnethy5HillRace, dtype: float64

In [24]:
df3.iloc[1:9] #accessing data by row range

                     distance  climb    time
race
Carnethy5HillRace         6.0  2.500   48.35
CraigDunainHillRace       6.0  0.900   33.65
BenRhaHillRace            7.5  0.800   45.60
BenLomondHillRace         8.0  3.070   62.27
GoatfellHillRace          8.0  2.866   73.22
BensofJuraFellRace       16.0  7.500  204.62
CairnpappleHillRace       6.0  0.800   36.37
ScoltyHillRace            5.0  0.800   29.75

In [25]:
df3[df3['distance']>6] #getting data filtered by condition

                           distance  climb    time
race
BenRhaHillRace                  7.5  0.800   45.60
BenLomondHillRace               8.0  3.070   62.27
GoatfellHillRace                8.0  2.866   73.22
BensofJuraFellRace             16.0  7.500  204.62
LairigGhruFunRun               28.0  2.100  192.67
LomondsofFifeHillRace           9.5  2.200   65.00
CairngormHillRace              10.0  3.000   72.25
SevenHillsofEdinburghRace      14.0  2.200   98.42
CriffelHillRace                 6.5  1.750   50.50
BenNevisRace                   10.0  4.400   85.58
TwoBreweriesFellRace           18.0  5.200  170.25
MoffatChase                    20.0  5.000  159.83

In [26]:
df3[(df3['distance']>6) & (df3['climb']>5)] #getting data filtered by two conditions

                      distance  climb    time
race
BensofJuraFellRace        16.0    7.5  204.62
TwoBreweriesFellRace      18.0    5.2  170.25

## Null value handling

In [2]:
s1=pd.Series([1,np.nan,3,np.nan,5])
display(s1)
df4=pd.DataFrame({'A':[1,2,np.nan,4],'B':[3,2,5,5],'C':[np.nan,7,np.nan,2]},index=['Jan','Feb','Mar','Apr'])
display(df4)

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

       A  B    C
Jan  1.0  3  NaN
Feb  2.0  2  7.0
Mar  NaN  5  NaN
Apr  4.0  5  2.0

In [3]:
s1.isnull() #show boolean True or False for null values

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [4]:
df4.isnull() #show True or False when exits null values

         A      B      C
Jan  False  False   True
Feb  False  False  False
Mar   True  False   True
Apr  False  False  False

In [5]:
s1.dropna() #returns the string with null values removed

0    1.0
2    3.0
4    5.0
dtype: float64

In [6]:
s11=s1.dropna() #assigning values to the variable
s11

0    1.0
2    3.0
4    5.0
dtype: float64

In [7]:
df4.dropna()

       A  B    C
Feb  2.0  2  7.0
Apr  4.0  5  2.0

In [8]:
df4.dropna(axis=1) #remember that axis=0 is referent to rows and axis=1 is referent to columns

     B
Jan  3
Feb  2
Mar  5
Apr  5

In [9]:
display(df4)
display(df4.dropna(how='all')) #remove all null values
df4.dropna(how='any') #remove any null values

       A  B    C
Jan  1.0  3  NaN
Feb  2.0  2  7.0
Mar  NaN  5  NaN
Apr  4.0  5  2.0

       A  B    C
Jan  1.0  3  NaN
Feb  2.0  2  7.0
Mar  NaN  5  NaN
Apr  4.0  5  2.0

       A  B    C
Feb  2.0  2  7.0
Apr  4.0  5  2.0

In [10]:
df4.fillna(0) #replace null values to zero

       A  B    C
Jan  1.0  3  0.0
Feb  2.0  2  7.0
Mar  0.0  5  0.0
Apr  4.0  5  2.0

In [11]:
s1

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

In [12]:
s1.fillna(method='ffill') #replace the null values with previous value

0    1.0
1    1.0
2    3.0
3    3.0
4    5.0
dtype: float64

In [13]:
s1.fillna(method='bfill') #replace the null values with next value

0    1.0
1    3.0
2    3.0
3    5.0
4    5.0
dtype: float64

In [15]:
display(df4)
df4.fillna(0)

       A  B    C
Jan  1.0  3  NaN
Feb  2.0  2  7.0
Mar  NaN  5  NaN
Apr  4.0  5  2.0

       A  B    C
Jan  1.0  3  0.0
Feb  2.0  2  7.0
Mar  0.0  5  0.0
Apr  4.0  5  2.0

In [16]:
df4.fillna(axis=1, method='ffill') #substitutes null values into the previous column value

       A    B    C
Jan  1.0  3.0  3.0
Feb  2.0  2.0  7.0
Mar  NaN  5.0  5.0
Apr  4.0  5.0  2.0